app/Services/AuthService.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `status_aktif` = 1
---
    public function attemptLogin(string $username, string $password): array
    {
        // 1. Rate limiting: 5x gagal berturut-turut (berbasis username) -> lock 5 menit
        if ($this->isLocked($username)) {
            // DEBUG SEMENTARA — hapus setelah bug login selesai
            log_message('debug', 'attemptLogin: DITOLAK karena LOCKED (>=5 gagal dalam 5 menit terakhir) untuk username={u}', ['u' => $username]);
            return ['success' => false, 'message' => 'Akun terkunci sementara. Coba lagi dalam beberapa menit.'];
        }

        $user = $this->db->table('users')
            ->where('username', $username)
            ->where('status_aktif', 1)
            ->get()
            ->getRowArray();

UPDATE `users` SET `auth_version` = 2, `updated_at` = '2026-09-03 10:19:43'
WHERE `id` = '1'
---
        $this->recordAttempt($username, true);

        $newAuthVersion = (int) $user['auth_version'] + 1;
        $this->db->table('users')->where('id', $user['id'])->update([
            'auth_version' => $newAuthVersion,
            'updated_at' => date('Y-m-d H:i:s'),
        ]);

SELECT COUNT(*) AS `numrows`
FROM `login_attempts`
WHERE `username` = 'admin'
AND `berhasil` = 0
AND `waktu` >= '2026-09-03 10:14:43'
---
    protected function isLocked(string $username): bool
    {
        $fiveMinutesAgo = date('Y-m-d H:i:s', strtotime('-5 minutes'));

        $failedCount = $this->db->table('login_attempts')
            ->where('username', $username)
            ->where('berhasil', 0)
            ->where('waktu >=', $fiveMinutesAgo)
            ->countAllResults();

INSERT INTO `login_attempts` (`username`, `ip_address`, `waktu`, `berhasil`) VALUES ('admin', '::1', '2026-09-03 10:19:43', 1)
---
    protected function recordAttempt(string $username, bool $berhasil): void
    {
        $this->db->table('login_attempts')->insert([
            'username' => $username,
            'ip_address' => service('request')->getIPAddress(),
            'waktu' => date('Y-m-d H:i:s'),
            'berhasil' => $berhasil ? 1 : 0,
        ]);

SELECT `role`
FROM `users`
WHERE `id` = 1
SELECT `role`
FROM `user_roles`
WHERE `id_user` = 1
---
    public function getUserRoles(int $userId): array
    {
        $roles = [];

        $primary = $this->db->table('users')->select('role')->where('id', $userId)->get()->getRowArray();
        if ($primary) {
            $roles[] = $primary['role'];
        }

        $extra = $this->db->table('user_roles')->select('role')->where('id_user', $userId)->get()->getResultArray();

SELECT `rp`.`scope`
FROM `role_permissions` `rp`
JOIN `permissions` `p` ON `p`.`id` = `rp`.`id_permission`
WHERE `rp`.`role` IN ('admin')
AND `p`.`permission_key` = 'dashboard.view'
---
    public function resolveScope(string $permissionKey, int $userId): string
    {
        $roles = $this->getUserRoles($userId);
        if (empty($roles)) {
            return 'TIDAK_ADA';
        }

        $rows = $this->db->table('role_permissions rp')
            ->select('rp.scope')
            ->join('permissions p', 'p.id = rp.id_permission')
            ->whereIn('rp.role', $roles)
            ->where('p.permission_key', $permissionKey)
            ->get()
            ->getResultArray();