app/Services/AuthService.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
AND `status_aktif` = 1
---
    public function attemptLogin(
        string $username,
        string $password
    ): array {
        $username = trim($username);

        if ($username === '' || $password === '') {
            return [
                'success' => false,
                'message' => 'Username dan password wajib diisi.',
            ];
        }

        /*
         * Cek lock berdasarkan username.
         */
        if ($this->isLocked($username)) {
            return [
                'success' => false,
                'message' => 'Akun terkunci sementara. Coba lagi dalam beberapa menit.',
            ];
        }

        /*
         * Ambil user aktif.
         */
        $user = $this->db
            ->table('users')
            ->where('username', $username)
            ->where('status_aktif', 1)
            ->get()
            ->getRowArray();

UPDATE `users` SET `auth_version` = 8, `updated_at` = '2026-09-07 11:14:36'
WHERE `id` = '1'
---
         */
        $newAuthVersion = ((int) ($user['auth_version'] ?? 0)) + 1;

        $updated = $this->db
            ->table('users')
            ->where('id', $user['id'])
            ->update([
                'auth_version' => $newAuthVersion,
                'updated_at' => date('Y-m-d H:i:s'),
            ]);

SELECT `berhasil`, `waktu`
FROM `login_attempts`
WHERE `username` = 'admin'
AND `waktu` >= '2026-09-05 08:44:49'
ORDER BY `waktu` DESC
 LIMIT 5
---
    protected function isLocked(string $username): bool
    {
        /*
         * Ambil 5 attempt terakhir untuk username.
         *
         * Tidak menggunakan WHERE waktu >= -5 menit sebagai
         * dasar utama karena yang menentukan lock adalah 5
         * kegagalan berturut-turut, lalu lock berlangsung 5 menit
         * sejak kegagalan ke-5.
         */
        $attempts = $this->db
            ->table('login_attempts')
            ->select('berhasil, waktu')
            ->where('username', $username)
            ->orderBy('waktu', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();

INSERT INTO `login_attempts` (`username`, `ip_address`, `waktu`, `berhasil`) VALUES ('admin', '::1', '2026-09-07 11:14:36', 1)
---
    protected function recordAttempt(
        string $username,
        bool $berhasil
    ): void {
        $this->db
            ->table('login_attempts')
            ->insert([
                'username' => $username,
                'ip_address' => service('request')->getIPAddress(),
                'waktu' => date('Y-m-d H:i:s'),
                'berhasil' => $berhasil ? 1 : 0,
            ]);

SELECT `role`
FROM `user_roles`
WHERE `id_user` = 1
SELECT `role`
FROM `users`
WHERE `id` = 1
---
    public function getUserRoles(int $userId): array
    {
        $roles = [];

        /*
         * Role utama.
         */
        $primary = $this->db
            ->table('users')
            ->select('role')
            ->where('id', $userId)
            ->get()
            ->getRowArray();

        if ($primary && !empty($primary['role'])) {
            $roles[] = (string) $primary['role'];
        }

        /*
         * Multi-role.
         */
        $extra = $this->db
            ->table('user_roles')
            ->select('role')
            ->where('id_user', $userId)
            ->get()
            ->getResultArray();

SELECT `rp`.`scope`
FROM `role_permissions` `rp`
JOIN `permissions` `p` ON `p`.`id` = `rp`.`id_permission`
WHERE `rp`.`role` IN ('admin')
AND `p`.`permission_key` = 'jadwal_guru.view'
---
    public function resolveScope(
        string $permissionKey,
        int $userId
    ): string {
        $roles = $this->getUserRoles($userId);

        if (empty($roles)) {
            return 'TIDAK_ADA';
        }

        $rows = $this->db
            ->table('role_permissions rp')
            ->select('rp.scope')
            ->join(
                'permissions p',
                'p.id = rp.id_permission'
            )
            ->whereIn('rp.role', $roles)
            ->where(
                'p.permission_key',
                $permissionKey
            )
            ->get()
            ->getResultArray();