app/Services/JadwalGuruService.php

    public function getOptions(
        int $userId,
        ?int $filterGuru = null
    ): array {
        $scope = $this->resolveViewScope($userId);
        $idGuruUser = $this->getIdGuruUser($userId);

        $guruBuilder = $this->db
            ->table('guru g')
            ->select('g.id, g.nip, g.nama')
            ->where('g.deleted_at', null);

        if ($scope === 'DIRI_SENDIRI') {
            if ($idGuruUser <= 0) {
                $guru = [];
            } else {
                $guru = $guruBuilder
                    ->where('g.id', $idGuruUser)
                    ->orderBy('g.nama', 'ASC')
                    ->get()
                    ->getResultArray();
            }
        } else {
            $guru = $guruBuilder
                ->orderBy('g.nama', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT `g`.`id`, `g`.`nip`, `g`.`nama`
FROM `guru` `g`
WHERE `g`.`deleted_at` IS NULL
ORDER BY `g`.`nama` ASC

            ->get()
            ->getResultArray();

        $tahun = $this->db
            ->table('tahun_ajaran')
            ->select('id, nama_tahun, semester, status_aktif')
            ->where('deleted_at', null)
            ->orderBy('nama_tahun', 'DESC')
            ->orderBy(
                "FIELD(semester,'Ganjil','Genap')",
                '',
                false
            )
            ->get()
            ->getResultArray();
---
SELECT `id`, `nama_tahun`, `semester`, `status_aktif`
FROM `tahun_ajaran`
WHERE `deleted_at` IS NULL
ORDER BY `nama_tahun` DESC, FIELD(semester,'Ganjil','Genap')

    protected function getIdGuruUser(int $userId): int
    {
        $row = $this->db
            ->table('users')
            ->select('id_guru')
            ->where('id', $userId)
            ->get()
            ->getRowArray();
---
SELECT `id_guru`
FROM `users`
WHERE `id` = 1