app/Services/KelasService.php

    public function getTahunOptions(): array
    {
        return $this->db
            ->table('tahun_ajaran')
            ->select('id, nama_tahun, semester, status_aktif')
            ->where('deleted_at', null)
            ->orderBy('nama_tahun', 'DESC')
            ->orderBy('semester', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `id`, `nama_tahun`, `semester`, `status_aktif`
FROM `tahun_ajaran`
WHERE `deleted_at` IS NULL
ORDER BY `nama_tahun` DESC, `semester` ASC