app/Services/MenuService.php

SELECT DISTINCT `rm`.`id_menu`
FROM `role_menus` `rm`
WHERE `rm`.`role` IN ('admin')
AND `rm`.`tampil` = 1
---
    public function getMenuTree(int $userId): array
    {
        if ($userId <= 0) {
            return [];
        }

        $roles = $this->authService->getUserRoles($userId);
        $identity = $this->getUserIdentity($userId);
        $idMenus = [];

        if ($roles !== []) {
            $menuRows = $this->db
                ->table('role_menus rm')
                ->select('rm.id_menu')
                ->distinct()
                ->whereIn('rm.role', $roles)
                ->where('rm.tampil', 1)
                ->get()
                ->getResultArray();

SELECT *
FROM `menus`
WHERE `id` IN (1,2,3,4,5,6,7,8,21,22,31,32,33,34,35,36,37,38,41,42,43,51,52,53,61,62,71,72,73,81,82)
ORDER BY `urutan` ASC
---
            return [];
        }

        $menus = $this->db
            ->table('menus')
            ->whereIn('id', $idMenus)
            ->orderBy('urutan', 'ASC')
            ->orderBy('id', 'ASC')
            ->get()
            ->getResultArray();