app/Services/PresensiMengajarService.php

    public function getGuruInputOptions(int $userId, string $tanggal): array
    {
        $tanggal = $this->normalizeTanggal($tanggal);

        if ($tanggal === '') {
            return [];
        }

        $tahun = $this->getTahunAktif();

        if ($tahun === null) {
            return [];
        }

        $scopes = $this->getPermissionScopes('presensi_mengajar.input', $userId);

        if ($scopes === []) {
            return [];
        }

        $hari = $this->hariIndonesia($tanggal);

        if (in_array('SEMUA', $scopes, true)) {
            return $this->db
                ->table('jadwal_guru jg')
                ->select('g.id, g.nama, g.nip')
                ->join('guru g', 'g.id = jg.id_guru')
                ->where('jg.id_tahun', (int) $tahun['id'])
                ->where('jg.hari', $hari)
                ->where('jg.status_jadwal', 'Aktif')
                ->where('g.deleted_at', null)
                ->groupBy('g.id, g.nama, g.nip')
                ->orderBy('g.nama', 'ASC')
                ->get()
                ->getResultArray();
---
SELECT `g`.`id`, `g`.`nama`, `g`.`nip`
FROM `jadwal_guru` `jg`
JOIN `guru` `g` ON `g`.`id` = `jg`.`id_guru`
WHERE `jg`.`id_tahun` = 1
AND `jg`.`hari` = 'Selasa'
AND `jg`.`status_jadwal` = 'Aktif'
AND `g`.`deleted_at` IS NULL
GROUP BY `g`.`id`, `g`.`nama`, `g`.`nip`
ORDER BY `g`.`nama` ASC

    private function getTahunAktif(): ?array
    {
        $row = $this->db
            ->table('tahun_ajaran')
            ->select('id, nama_tahun, semester')
            ->where('status_aktif', 1)
            ->where('deleted_at', null)
            ->get()
            ->getRowArray();
---
SELECT `id`, `nama_tahun`, `semester`
FROM `tahun_ajaran`
WHERE `status_aktif` = 1
AND `deleted_at` IS NULL

    private function getPermissionScopes(string $permissionKey, int $userId): array
    {
        $roles = $this->authService->getUserRoles($userId);

        if ($roles === []) {
            return [];
        }

        $rows = $this->db
            ->table('role_permissions rp')
            ->select('rp.scope')
            ->join('permissions p', 'p.id = rp.id_permission')
            ->whereIn('rp.role', $roles)
            ->where('p.permission_key', $permissionKey)
            ->get()
            ->getResultArray();
---
SELECT `rp`.`scope`
FROM `role_permissions` `rp`
JOIN `permissions` `p` ON `p`.`id` = `rp`.`id_permission`
WHERE `rp`.`role` IN ('admin')
AND `p`.`permission_key` = 'presensi_mengajar.input'