app/Services/PresensiService.php

SELECT `id`, `nama_kelas`, `tingkat`, `rombel`
FROM `kelas`
WHERE `id_tahun` = 1
AND `deleted_at` IS NULL
ORDER BY `tingkat` ASC, `rombel` ASC
---
    public function getKelasInputOptions(int $userId, string $tanggal): array
    {
        $tanggal = $this->normalizeTanggal($tanggal);

        if ($tanggal === '') {
            return [];
        }

        $tahun = $this->getTahunAktif();

        if ($tahun === null) {
            return [];
        }

        $scopes = $this->getPermissionScopes('presensi_siswa.input', $userId);

        if (in_array('SEMUA', $scopes, true)) {
            return $this->db
                ->table('kelas')
                ->select('id, nama_kelas, tingkat, rombel')
                ->where('id_tahun', (int) $tahun['id'])
                ->where('deleted_at', null)
                ->orderBy('tingkat', 'ASC')
                ->orderBy('rombel', 'ASC')
                ->get()
                ->getResultArray();

SELECT *
FROM `tahun_ajaran`
WHERE `status_aktif` = 1
AND `deleted_at` IS NULL
---
    private function getTahunAktif(): ?array
    {
        $row = $this->db
            ->table('tahun_ajaran')
            ->where('status_aktif', 1)
            ->where('deleted_at', null)
            ->get()
            ->getRowArray();

SELECT `rp`.`scope`
FROM `role_permissions` `rp`
JOIN `permissions` `p` ON `p`.`id` = `rp`.`id_permission`
WHERE `rp`.`role` IN ('admin')
AND `p`.`permission_key` = 'presensi_siswa.input'
---
    private function getPermissionScopes(string $permissionKey, int $userId): array
    {
        $roles = $this->authService->getUserRoles($userId);

        if ($roles === []) {
            return [];
        }

        $rows = $this->db
            ->table('role_permissions rp')
            ->select('rp.scope')
            ->join('permissions p', 'p.id = rp.id_permission')
            ->whereIn('rp.role', $roles)
            ->where('p.permission_key', $permissionKey)
            ->get()
            ->getResultArray();