app/Filters/AuthFilter.php

SELECT `auth_version`, `status_aktif`
FROM `users`
WHERE `id` = '1'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        if (!session()->get('logged_in')) {
            session()->setFlashdata('error', 'Silakan login terlebih dahulu.');
            return redirect()->to('/auth/login');
        }

        // Single Active Session: cek auth_version session vs database
        $db = Database::connect();
        $user = $db->table('users')
            ->select('auth_version, status_aktif')
            ->where('id', session()->get('user_id'))
            ->get()
            ->getRowArray();

        if (!$user || (int) $user['status_aktif'] !== 1 || (int) $user['auth_version'] !== (int) session()->get('auth_version')) {