app/Filters/MaintenanceFilter.php

SELECT `setting_value`
FROM `setting_sistem`
WHERE `setting_key` = 'maintenance_mode'
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $db = Database::connect();

        $setting = $db->table('setting_sistem')
            ->select('setting_value')
            ->where('setting_key', 'maintenance_mode')
            ->get()
            ->getRowArray();