app/Filters/MaintenanceFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        // Jangan blokir route publik penting (login, api auth, verifikasi QR)
        $whitelist = ['auth/login', 'auth/logout', 'api/auth/login', 'api/auth/refresh', 'api/version'];
        $path      = ltrim($request->getPath(), '/');

        foreach ($whitelist as $allowed) {
            if (str_starts_with($path, $allowed)) {
                return null;
            }
        }

        $db  = Database::connect();
        $row = $db->table('setting_sistem')->where('setting_key', 'maintenance_mode')->get()->getRow();
---
SELECT *
FROM `setting_sistem`
WHERE `setting_key` = 'maintenance_mode'