app/Controllers/Dashboard.php

    protected function widgetsAdminOperator(): array
    {
        return [
            'total_siswa_aktif' => $this->db->table('siswa')->where('status_aktif', 'Aktif')->where('deleted_at', null)->countAllResults(),
            'total_guru'        => $this->db->table('guru')->where('deleted_at', null)->countAllResults(),
            'total_kelas'       => $this->db->table('kelas')->where('deleted_at', null)->countAllResults(),
            'aktivitas_terakhir' => $this->db->table('log_activity')->orderBy('waktu', 'DESC')->limit(10)->get()->getResultArray(),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `siswa`
WHERE `status_aktif` = 'Aktif'
AND `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `guru`
WHERE `deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `kelas`
WHERE `deleted_at` IS NULL
SELECT *
FROM `log_activity`
ORDER BY `waktu` DESC
 LIMIT 10